{
  "posts": [
    {
      "id": "2",
      "title": "The Future of Web Development",
      "author": "Amos Kipkorir",
      "date": "2025-06-22",
      "image": "https://images.unsplash.com/photo-1498050108023-c5249f4df085",
      "content": "The future of web development is rapidly evolving, driven by advancements in technologies like AI, WebAssembly, and low-code/no-code platforms. Developers will increasingly focus on building faster, more accessible, and personalized web experiences using frameworks like React, Svelte, and tools like AI-assisted coding. With the rise of progressive web apps (PWAs), headless CMSs, and seamless API integrations, the line between native and web applications will continue to blur, pushing the boundaries of what’s possible on the web."
    },
    {
      "id": "3",
      "title": "Front-End Developer",
      "author": "Jeshurun Gichugu",
      "date": "2025-06-22",
      "image": "https://images.unsplash.com/photo-1486312338219-ce68d2c6f44d",
      "content": "A front-end developer is a software engineer who specializes in building the user interface of websites and web applications. They use languages like HTML, CSS, and JavaScript to create interactive, visually appealing, and responsive experiences for users. Front-end developers also work closely with designers and back-end developers to ensure seamless functionality and user experience across devices and browsers."
    },
    {
      "id": "1",
      "title": "Things fall apart",
      "author": "Chinua Achebe",
      "date": "2025-06-23",
      "content": "Chinua Achebe was a celebrated Nigerian writer and intellectual, often regarded as the father of African literature in English. His most famous work, Things Fall Apart (1958), tells the story of Okonkwo, a proud Igbo warrior whose life unravels as British colonialism and Christian missionaries disrupt traditional society. The novel is a powerful critique of colonialism and a rich portrayal of African culture, widely studied around the world.",
      "image": "https://i.pinimg.com/736x/ee/ca/a8/eecaa85f6d85c5788bd0891c69b29a74.jpg"
    }
  ]
}